Wk9/W9D2/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
      if params[:id]
        render json: Artwork.gather(params[:id])
      else
        render json: Artwork.all