Wk9/W9D2/art_share_api/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("author_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 10], ["artwork_id", 1], ["body", "Streamlined flubber nuggets"], ["created_at", "2019-06-18 21:31:01.684740"], ["updated_at", "2019-06-18 21:31:01.684740"]]

    def show
        comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]