Wk9/W9D2/art_share_api/app/controllers/users_controller.rb

  def index
    if params[:user][:username]
      render json: User.find_by(username: params[:user][:username])
    else
      users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Ilka@gnet.serve"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (usermame = NULL)